app/Repositories/Front/UserRepository.php

    public function createUser( UserRequest $request ){

        DB::beginTransaction();
        try {
                $emailOTP = rand(1,9).rand(0,9).rand(0,9).rand(0,9);
                $newUser = new User;
                $newUser->name = $request->name;
                $newUser->email = $request->email;
                $newUser->password = bcrypt($request->password);
                $newUser->usertype = $request->usertype;
                $newUser->email_otp = $emailOTP;
                //todo update the code below to supply the stripe product id here instead.
                if( $request->usertype == 'Shelter' )
                    $newUser->stripe_product_id = STRIPE_SHELTER_PLAN;
                else if( $request->usertype == 'Breeder')
                    $newUser->stripe_product_id = STRIPE_BREEDER_PLAN;
                else
                    $newUser->stripe_product_id = '';

                $newUser->save();
---
insert into `users` (`name`, `email`, `password`, `usertype`, `email_otp`, `stripe_product_id`, `updated_at`, `created_at`) values ('jhoni', 'jhoni@doe.com', '$2y$10$HzLIWgvUrm95pB9zqu9/IOUv.OJpNQTpGavMzC4bExXxx1.x07gkK', 'Breeder', '2771', 'price_1K7HkuBuir1vjVYcJwPCY5Yq', '2021-12-21 19:54:00', '2021-12-21 19:54:00')

                        $newBreeder->postal_code = $request->postal_code;
                        $newBreeder->country = $request->country;
                    }
                    $newBreeder->save();
---
insert into `breeders` (`owner_name`, `company_name`, `user_id`, `street`, `city`, `postal_code`, `country`, `updated_at`, `created_at`) values ('jhoni', 'jhoni', 2688, '', '', '', 'canada', '2021-12-21 19:54:00', '2021-12-21 19:54:00')