app/Http/Controllers/Admin/Dashboard/DashboardController.php

    public function show(){
        $result['adCount'] = Ad::get()->count();
        $result['expectedBabieCount'] = ExpectedBabie::get()->count();
        $result['userCount'] = User::whereIn( 'usertype', [ 'Normal', 'Shelter', 'Breeder' ] )->get()->count();
        $result['renewalCount'] = Renewal::get()->count();
        $result['ads'] = Ad::where('status', '=', 1)->with(['adKind','adRace','adUser'])->orderByDesc('id')->take(10)->get();
---
select * from `users` where `usertype` in ('Normal', 'Shelter', 'Breeder')
select * from `kinds` where `kinds`.`id` in (1, 2)
select * from `races` where `races`.`id` in (8, 16, 21, 31, 39, 48, 61, 90, 98, 137)
select * from `users` where `users`.`id` in (2668, 2672, 2675, 2679, 2681, 2683)