app/Repositories/AdRepository.php

    public function showCountsForLeftBar(){
        $result['adCount'] = Ad::get()->count();
        $result['expectedBabieCount'] = ExpectedBabie::get()->count();
        $result['userCount'] = User::whereIn( 'usertype', [ 'Normal', 'Shelter', 'Breeder' ] )->get()->count();
---
select * from `users` where `usertype` in ('Normal', 'Shelter', 'Breeder')