app/Repositories/UserRepository.php

select * from `breeders` where `breeders`.`user_id` in (2242, 2318, 2322, 2331, 2335, 2342, 2361, 2429, 2436, 2438, 2450, 2514, 2519, 2546, 2561, 2590, 2597, 2604, 2605, 2618, 2658)
select * from `renewals` where `renewals`.`user_id` in (2242, 2318, 2322, 2331, 2335, 2342, 2361, 2429, 2436, 2438, 2450, 2514, 2519, 2546, 2561, 2590, 2597, 2604, 2605, 2618, 2658) order by `created_at` desc
select count(*) as aggregate from `users` where `usertype` != 'Admin'
---
    public function listUsers(){
        $data['result'] = User::where('usertype' , '!=' , 'Admin')
                                ->withCount(['userAds','userExpectedBabies'])
                                ->with(['Breeder', 'latestRenewal'])
                                ->orderBy('name', 'ASC')
                                ->paginate(REC_PER_PAGE);

select * from `breeders` where `breeders`.`user_id` in (2682, 2683, 2684)
select count(*) as aggregate from `users` where `name` like '%zeeshan%' and `usertype` != 'Admin' and (`usertype` = 'Normal')
---
    public function searchUsers(Request $request)
    {
        $query = $request->get('query');
        $sortBy = $request->get('sortby');
        $sortType = $request->get('sorttype');
        $userType = $request->get('type');
        if( $userType == 'Normal' or $userType == 'Shelter' or $userType == 'Breeder' ){

        } else {
            $userType = '';
        }

        if($request->ajax())
        {
            $output="";
            $data['result'] = User::where('name', 'like', '%'.$query.'%')
                ->where('usertype' , '!=' , 'Admin')
                ->where( function( $query ) use ( $userType ) {
                    if( $userType != '' )
                    $query->where( 'usertype', '=', $userType );
                } )
                ->withCount(['userAds','userExpectedBabies'])
                ->with('Breeder')
                ->paginate(REC_PER_PAGE);

select * from `breeders` where `user_id` = '2688' limit 1
---
                    $isClean = false;
                }

                $breederRec = Breeder::where('user_id', '=', $request->userId )->first();

update `breeders` set `country` = '', `breeders`.`updated_at` = '2021-12-21 20:04:19' where `id` = 1336
---

                    if( $breederRec->isDirty() )
                    {
                        $breederRec->save();